Revit 2026 API

# IFCHybridImportOptions Methods

---

The IFCHybridImportOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Create | Create a IFCHybridImportOptions from an options string, or null if it isn't hybrid mode. |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |
|  | ToString(IFCHybridImportOptions) | Converts the IFCHybridImportOptions class to a revit.ini-compatible string. |

#### Reference

IFCHybridImportOptions Class

Autodesk.Revit.DB.IFC Namespace